
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   14.2   Copyright 1985-2015 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

18-user 8-core Stata network perpetual license:
       Serial number:  501406201034
         Licensed to:  National Bureau of Economic Research
                       Cambridge, MA 02138

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.


running /disk/admin/Linux-local/stata14/sysprofile.do ...

. do "source/02_figures_tables/tables_nberchapter.do" 

. set more off

. local trial_data "data/clinical_trials_07-23-17.dta"

. local trial_data_sample "data/ct_sample.dta"

. 
. /*
> use `trial_data', clear
> **Write a sample to disk for testing code
> set seed 101
> sample 10 
> save `trial_data_sample', replace
> */
. 
. //use `trial_data_sample', clear
. use `trial_data', clear

. 
. **Select universe of trials
. keep if phase_1 == 1 | phase_2 == 1 | phase_3 == 1
(127,557 observations deleted)

. 
. **Recode trials with multiple phase designations
. replace phase_2 = 0 if phase_1 == 1 & phase_2 == 1
(11,514 real changes made)

. replace phase_3 = 0 if phase_2 == 1 & phase_3 == 1
(5,699 real changes made)

. ***verify (there should be no elements in (1,1) ) 
. table phase_1 phase_2

--------------------------
          |    phase_2    
  phase_1 |      0       1
----------+---------------
        0 | 33,348  64,155
        1 | 49,487        
--------------------------

. table phase_2 phase_3

--------------------------
          |    phase_3    
  phase_2 |      0       1
----------+---------------
        0 | 49,487  33,348
        1 | 64,155        
--------------------------

. 
. **Generate useful variables
. ***Trial start and end years
. gen year_start = year(date_start)
(6,292 missing values generated)

. gen year_end = year(date_end)
(45,081 missing values generated)

. 
. ***Trial duration: throw out trials with duration less than 1 days
. gen duration = (date_end - date_start) / 30
(45,568 missing values generated)

. label variable duration "Trial duration in months"

. replace duration = . if duration <= 0
(1,456 real changes made, 1,456 to missing)

. replace duration = . if duration > 1000
(1 real change made, 1 to missing)

. 
. **Label variables 
. cap label drop biomarker_label

.         label define biomarker_label 0 "No biomarker" 1 "Biomarker"

.         label values biomarker_status biomarker_label

. cap label drop nih_label

.         label define nih_label 0 "No funding" 1 "NIH funding"

.         label values nih_funding nih_label

. cap label drop year_labels

.         label define year_labels 1995 1995

.         label values year_start year_labels

.         label values year_end year_labels

. 
. **Define directory for reports
. set more off

. local report_dir "reports/report_7-25-17"

. local table_dir "`report_dir'/tables"

. local figure_dir "`report_dir'/figures"

. local interim_table_dir "`table_dir'/interim"

. local finished_table_dir "`table_dir'/finished"

. 
. foreach dir in `report_dir' `table_dir' `figure_dir' `interim_table_dir' `fin
> ished_table_dir' {
  2.         !mkdir "`dir'"
  3. }

mkdir: cannot create directory `reports/report_7-25-17': File exists

mkdir: cannot create directory `reports/report_7-25-17/tables': File exists

mkdir: cannot create directory `reports/report_7-25-17/figures': File exists

mkdir: cannot create directory `reports/report_7-25-17/tables/interim': File ex
> ists

mkdir: cannot create directory `reports/report_7-25-17/tables/finished': File e
> xists

. 
. 
. 
. do "source/02_figures_tables/tables_fns_edit7-25.do"

. **HELPER FUNCTIONS**
. cap program drop prep_phases

. program define prep_phases
  1.         syntax, ///
>         
  2.         drop phase
  3.         gen phase = .
  4.         replace phase = 1 if phase_1 == 1
  5.         replace phase = 2 if phase_2 == 1
  6.         replace phase = 3 if phase_3 == 1
  7.         gen phase_123 = (phase_1 | phase_2 | phase_3)
  8. end

. 
. **MAIN FUNCTIONS**
. **All-time xtab of funding count by biomarker presence
. cap program drop nih_funding_by_bmkr

. program define nih_funding_by_bmkr
  1.         syntax, ///
>         [table_path(string)]
  2.                 
.         preserve
  3.         
.         quietly estpost tabulate biomarker_status nih_funding
  4. 
.         if "`table_path'" != "" local write_tex "using `table_path'"
  5.         esttab . `write_tex', ///
>                 replace ///
>                 title("Number of trials receiving NIH funding by presence of 
> biomarker") ///
>                 b(%8.0gc) ///
>                 compress ///
>                 unstack ///
>                 noobs nonotes nonum ///
>                 label ///
>                                         
  6.         restore 
  7. end

. 
. 
. **All-time xtab of funding probability by biomarker presence and location (tr
> ial in US)
. cap program drop nih_funding_by_bmkr_us

. program define nih_funding_by_bmkr_us
  1.         syntax, ///
>         [table_path(string)]
  2.                 
.         preserve
  3.         eststo clear
  4.                 
.         label variable nih_funding "Number of trials receiving funding"
  5.         
.         eststo A: quietly total nih_funding, over(biomarker_status)
  6.         eststo B: quietly total nih_funding if us_trial == 1, over(biomark
> er_status)
  7.         eststo C: quietly total nih_funding if us_trial == 0, over(biomark
> er_status)
  8.                 
.         if "`table_path'" != "" local write_tex "using `table_path'"
  9.         
.         esttab A B C  `write_tex', ///
>                 replace ///
>                 title("Number of trials receiving NIH funding by presence of 
> biomarker") ///
>                 label mtitle("All Trials" "US Trials" "Non-US Trials") ///
>                 cells(b se(fmt(a1) par)) ///
>                 collabels(none) ///
>                 rename(_subpop_1 "No biomarker") ///
>                 noobs ///
>                 fragment ///
>         
 10.         cap drop nih_times100
 11.         gen nih_times100 = nih_funding * 100
 12.         label variable nih_times100 "Percent of trials receiving funding"
 13. 
.         eststo A: quietly mean nih_times100, over(biomarker_status)
 14.         eststo B: quietly mean nih_times100 if us_trial == 1, over(biomark
> er_status)
 15.         eststo C: quietly mean nih_times100 if us_trial == 0, over(biomark
> er_status)
 16. 
.         esttab A B C `write_tex', ///
>                 append ///
>                 label ///
>                 mtitle("" "" "") ///
>                 cells(b(fmt(1)) se(fmt(2) par)) ///
>                 scalars(N) ///
>                 sfmt(%8.0gc) ///
>                 collabels(none) ///
>                 rename(_subpop_1 "No biomarker") ///
>                 nonum ///
>                 fragment                
 17.                                         
.         restore 
 18. end

. 
. 
. **All-time xtab of funding probability by biomarker presence and phase
. cap program drop nih_funding_by_bmkr_phase

. program define nih_funding_by_bmkr_phase
  1.         syntax, ///
>         [table_path(string)]
  2.                 
.         preserve
  3.         eststo clear
  4.                 
.         label variable nih_funding "Number of trials receiving funding"
  5.         
.         
.         eststo A: quietly total nih_funding, over(biomarker_status)
  6.         eststo B: quietly total nih_funding if phase_1 == 1, over(biomarke
> r_status)
  7.         eststo C: quietly total nih_funding if phase_2 == 1, over(biomarke
> r_status)
  8.         eststo D: quietly total nih_funding if phase_3 == 1, over(biomarke
> r_status)
  9.                 
.         if "`table_path'" != "" local write_tex "using `table_path'"
 10.         
.         esttab A B C D `write_tex', ///
>                 replace ///
>                 title("Number of trials receiving NIH funding by presence of 
> biomarker") ///
>                 label mtitle("All Trials" "Phase I" "Phase II" "Phase III") /
> //
>                 cells(b se(fmt(a1) par)) ///
>                 collabels(none) ///
>                 rename(_subpop_1 "No biomarker") ///
>                 noobs nonum ///
>                 fragment ///
>                                         
 11.         cap drop nih_times100
 12.         gen nih_times100 = nih_funding * 100
 13.         label variable nih_times100 "Percent of trials receiving funding"
 14. 
.         eststo A: quietly mean nih_times100, over(biomarker_status)
 15.         eststo B: quietly mean nih_times100 if phase_1 == 1, over(biomarke
> r_status)
 16.         eststo C: quietly mean nih_times100 if phase_2 == 1, over(biomarke
> r_status)
 17.         eststo D: quietly mean nih_times100 if phase_3 == 1, over(biomarke
> r_status)
 18.                                         
.         esttab A B C D `write_tex', ///
>                 append ///
>                 label ///
>                 mtitle("" "" "" "") ///
>                 cells(b(fmt(1)) se(fmt(2) par)) ///
>                 scalars(N) ///
>                 sfmt(%8.0gc) ///
>                 collabels(none) ///
>                 rename(_subpop_1 "No biomarker") ///
>                 nonum ///
>                 fragment ///
>                                         
 19.         restore 
 20. end

. 
. 
. cap program drop nih_funding_by_bmkrrole

. program define nih_funding_by_bmkrrole
  1.         syntax, ///
>         [table_path(string)]
  2.                 
.         preserve
  3.         eststo clear
  4.                 
.         cap drop nih_times100
  5.         gen nih_times100 = nih_funding * 100
  6.         label variable nih_times100 "Percent receiving funding"
  7.         
.         quietly mean nih_times100
  8.         estimates store all
  9.         
.         quietly mean nih_times100 if biomarker_status == 0
 10.         estimates store no_biomarker
 11.         
.         quietly mean nih_times100 if biomarker_status == 1
 12.         estimates store biomarker
 13.         
.         quietly mean nih_times100 if disease_marker_role == 1
 14.         estimates store disease
 15. 
.         quietly mean nih_times100 if therapeutic_marker_role == 1
 16.         estimates store therapeutic_effect
 17.         
.         quietly mean nih_times100 if toxic_marker_role == 1
 18.         estimates store toxic_effect
 19.                 
.         quietly mean nih_times100 if not_determined_marker_role == 1
 20.         estimates store not_determined
 21.                 
.         if "`table_path'" != "" local write_tex "using `table_path'"
 22.         esttab all no_biomarker biomarker disease therapeutic_effect toxic
> _effect not_determined ///
>                 `write_tex', ///
>                 replace ///
>                 nostar se b(1) ///
>                 mtitle( "All Trials" "No Biomarker" "Biomarker present" "Dise
> ase" ///
>                         "Therapeutic effect" "Toxic effect" "Role not determi
> ned") ///
>                 compress ///
>                 label ///
>                 title("Percent of trials receiving NIH funding by biomarker r
> ole") ///
>                 addnote("Trials may employ multiple biomarkers with one or mo
> re biomarker roles.") 
 23.                                         
.         restore 
 24. end

. 
. *Table of trial count by phase 
. cap program drop trial_phase

. program define trial_phase
  1.         syntax, ///
>         [table_path(string)]
  2.                 
.         preserve
  3.         
.         quietly estpost tabulate phase
  4. 
.         if "`table_path'" != "" local write_tex "using `table_path'"
  5.         
.         esttab . `write_tex', ///
>                 replace                                         ///
>                 cells("b(fmt(%8.0gc)) pct(fmt(1))")             ///
>                 title("Trials by Phase")                        ///
>                 collabels("Trial count" "Percent of all Phase I-III") ///
>                 nomtitle                                        ///
>                 compress                                        ///
>                 noobs                                           ///
>                 nonum                                           ///
>                                         
  6.         restore 
  7. end

. 
. 
. **Table of variable means over nih funding status
. cap program drop nih_funding_means

. program define nih_funding_means
  1.         syntax, ///
>         [table_path(string)]
  2.                 
.         preserve
  3.         
.         local vars      us_trial ///
>                         biomarker_status ///
>                         patient_count_enrollment ///
>                         duration                
  4. 
.         eststo all: quietly mean `vars'
  5.         eststo nih_yes: quietly mean `vars' if nih_funding == 0
  6.         eststo nih_no: quietly mean `vars' if nih_funding == 1
  7. 
.         if "`table_path'" != "" local write_tex "using `table_path'"
  8.         esttab all nih_yes nih_no `write_tex', ///
>                 replace ///
>                 unstack ///
>                 cells("b(fmt(a2)) se(fmt(a2))") ///
>                 title("Selected averages by NIH funding status") ///
>                 mtitles("All trials" "No NIH funding" "NIH funding") ///
>                 varlabels(      us_trial "US trial" biomarker_status "Biomark
> er used" ///
>                                 patient_count_enrollment "Subjects enrolled" 
> duration "Duration") ///
>                 collabels("Average" "Standard error") ///
>                 noobs compress
  9.                                         
.         restore 
 10. end

. 
. 
. **Table of average trial duration over years
. cap program drop trial_duration_by_yr

. program define trial_duration_by_yr
  1.         syntax, ///
>         [figure_path(string)] [table_path(string)]
  2.                 
.         preserve
  3.         
.         local first_year 2000 
  4.         local last_year 2016
  5.         keep if year_end >= `first_year' & year_end <= `last_year'
  6.         prep_phases
  7. 
.         *Plot
.         quietly reg duration i.year_end
  8.         quietly margins, over(year_end) post
  9.         marginsplot, ///
>                 title("Average trial duration in months") ///
>                 xlabel(2000(5)2015) ///
>                 ylabel(18(6)54) ///
>                 xtitle("Trial end year") ///
>                 ytitle("Trial duration in months") 
 10.         if "`figure_path'" != "" graph export "`figure_path'", replace
 11.         
.         *Table
.         if "`table_path'" != "" local write_tex "using `table_path'"
 12.         esttab . `write_tex', ///
>                 replace ///
>                 cells("b(fmt(1)) _N(fmt(%8.0gc))") ///
>                 title("Average trial duration in months") ///
>                 not nostar nonum ///
>                 label ///
>                 collabels("Duration (months)" "\# of trials with nonmissing d
> uration", lhs("End year"))
 13.                         
.         restore 
 14. end

. 
. 
. **Table of average trial duration over years by phase
. cap program drop trial_duration_by_yr_phase

. program define trial_duration_by_yr_phase
  1.         syntax, ///
>         [figure_path(string)] [table_path(string)]
  2.                 
.         preserve
  3.         
.         local first_year 2000 
  4.         local last_year 2016
  5.         keep if year_end >= `first_year' & year_end <= `last_year'
  6.         prep_phases
  7. 
.         *Plot
.         quietly reg duration i.year_end##i.phase
  8.         quietly margins, over(year_end phase) post
  9.         marginsplot, ///
>                 title("Average trial duration in months") ///
>                 xlabel(2000(5)2015) ///
>                 ylabel(18(6)42) ///
>                 xtitle("Trial end year") ///
>                 ytitle("Trial duration in months") 
 10.         if "`figure_path'" != "" graph export "`figure_path'", replace
 11. 
.         *Table
.         if "`table_path'" != "" local write_tex "using `table_path'"
 12.         
.         foreach year of numlist `first_year'/`last_year' {
 13.         local i = `year' - `first_year' + 1
 14.         local labels `labels' _subpop_`i' `year'
 15.         }
 16. 
.         eststo A: quietly mean duration, over(year_end)
 17.         eststo B: quietly mean duration if phase == 1, over(year_end)
 18.         eststo C: quietly mean duration if phase == 2, over(year_end)
 19.         eststo D: quietly mean duration if phase == 3, over(year_end)
 20. 
.         label variable duration " "
 21.         if "`table_path'" != "" local write_tex "using `table_path'"
 22.         esttab A B C D  `write_tex', ///
>                         coeflabels(`labels') not nostar nonum ///
>                         replace ///
>                         label ///
>                         cells("_N(fmt(%8.0gc)) b(fmt(1))") ///
>                         title("Average trial duration in months") ///
>                         collabels("Number of trials" "Average duration", lhs(
> "End year")) ///
>                         mtitles("All trials with start and end dates" ///
>                                 "Phase I" ///
>                                 "Phase II" ///
>                                 "Phase III" ///
>                                 )       
 23.         restore 
 24. end

. 
. 
. 
. **Table of average trial duration over years by biomarker status
. cap program drop trial_duration_by_yr_bmkr

. program define trial_duration_by_yr_bmkr
  1.         syntax, ///
>         [figure_path(string)] [table_path(string)]
  2.                 
.         preserve
  3.         
.         local first_year 2000 
  4.         local last_year 2016
  5.         prep_duration, first_year(`first_year') last_year(`last_year') 
  6. 
.         *Plot
.         quietly reg duration i.year_end##i.biomarker_status
  7.         quietly margins, over(year_end biomarker_status) post
  8.         marginsplot, ///
>                 title("Average trial duration in months") ///
>                 xlabel(2000(5)2015) ///
>                 ylabel(18(6)42) ///
>                 xtitle("Trial end year") ///
>                 ytitle("Trial duration in months") 
  9.         if "`figure_path'" != "" graph export "`figure_path'", replace
 10. 
.         *Table  
.         foreach year of numlist `first_year'/`last_year' {
 11.         local i = `year' - `first_year' + 1
 12.         local labels `labels' _subpop_`i' `year'
 13.         }
 14. 
.         eststo A: quietly mean duration, over(year_end)
 15.         eststo B: quietly mean duration if biomarker_status == 0, over(yea
> r_end)
 16.         eststo C: quietly mean duration if biomarker_status == 1, over(yea
> r_end)
 17. 
.         label variable duration " "
 18.         if "`table_path'" != "" local write_tex "using `table_path'"
 19.         esttab A B C    `write_tex', ///
>                         coeflabels(`labels') not nostar nonum ///
>                         replace ///
>                         label ///
>                         cells(" _N(fmt(%8.0gc)) b(fmt(1))") ///
>                         title("Average trial duration in months") ///
>                         collabels("Number of trials" "Average duration", lhs(
> "End year")) ///
>                         mtitles("All trials with start and end dates" ///
>                                 "No biomarkers" ///
>                                 "Biomarker(s) used" ///
>                                 )       
 20.         restore 
 21. end

. 
. 
. **Table of NIH funding probability over year by biomarker status
. cap program drop nih_funding_by_yr_bmkr

. program define nih_funding_by_yr_bmkr
  1.         syntax, ///
>         [figure_path(string)] [table_path(string)]
  2.                 
.         preserve
  3. 
.         *define subset of trials
.         local first_year 1995
  4.         local last_year 2016
  5.         keep if year_start >= `first_year' & year_start <= `last_year'
  6. 
.         *scale response variable to percentage scale
.         cap drop nih_times100
  7.         gen nih_times100 = nih_funding * 100 
  8.         
.         *Plot
.         quietly reg nih_times100 i.year_start##i.biomarker_status
  9.         quietly margins, over(year_start biomarker_status) post
 10.         marginsplot, ///
>                 title("Percent of trials receiving NIH funding: `samplestring
> '") ///
>                 xlabel(1995(5)2015) ///
>                 ylabel(0(5)20) ///
>                 xtitle("Trial Start Year") ///
>                 ytitle("Percent of trials funded by the NIH") ///
>                 yscale(r(0 20)) ///
>                 noci
 11.         if "`figure_path'" != "" graph export "`figure_path'", replace
 12. 
.         *Table
.         foreach year of numlist `first_year'/`last_year' {
 13.         local i = `year' - `first_year' + 1
 14.         local labels `labels' _subpop_`i' `year'
 15.         }
 16. 
.         eststo A: quietly mean nih_times100, over(year_start)
 17.         eststo B: quietly mean nih_times100 if biomarker_status == 0, over
> (year_start)
 18.         eststo C: quietly mean nih_times100 if biomarker_status == 1, over
> (year_start)
 19. 
.         label variable nih_times100 " "
 20.         if "`table_path'" != "" local write_tex "using `table_path'"
 21.         esttab A B C    `write_tex', ///
>                         coeflabels(`labels') not nostar nonum ///
>                         replace ///
>                         label ///
>                         cells("_N(fmt(%8.0gc)) b(fmt(1))") ///
>                         title("Percent of trials receiving NIH funding by pre
> sence of biomarker") ///
>                         collabels("Number of trials" "Percent funded", lhs("S
> tart year")) ///
>                         mtitles("All trials with start and end dates" ///
>                                 "No biomarkers" ///
>                                 "Biomarker(s) used" ///
>                                 )       
 22.         restore 
 23. end

. 
. cap program drop nih_funding_by_yr_phase

. program define nih_funding_by_yr_phase
  1.         syntax, ///
>         [figure_path(string)] [table_path(string)]
  2.                 
.         preserve
  3. 
.         *define subset of trials
.         local first_year 1995
  4.         local last_year 2016
  5.         keep if year_start >= `first_year' & year_start <= `last_year'
  6.         prep_phases
  7. 
.         *scale response variable to percentage scale
.         cap drop nih_times100
  8.         gen nih_times100 = nih_funding * 100 
  9.         
.         *Plot
.         quietly reg nih_times100 i.year_start##i.phase
 10.         quietly margins, over(year_start phase) post
 11.         marginsplot, ///
>                 title("Percent of trials receiving NIH funding by trial phase
> ") ///
>                 xlabel(1995(5)2015) ///
>                 ylabel(0(1)10) ///
>                 xtitle("Trial Start Year") ///
>                 ytitle("Percent of trials funded by the NIH") ///
>                 yscale(r(0 10)) ///
>                 noci
 12.         if "`figure_path'" != "" graph export "`figure_path'", replace
 13. 
.         *Table
.         foreach year of numlist `first_year'/`last_year' {
 14.         local i = `year' - `first_year' + 1
 15.         local labels `labels' _subpop_`i' `year'
 16.         }
 17.         
.         format nih_times100 %1.0f
 18.         format phase_123 %16H
 19. 
.         eststo clear    
 20.         eststo A: quietly mean nih_times100 if phase_123 == 1 , over(year_
> start)
 21.         eststo B: quietly mean nih_times100 if phase == 1 , over(year_star
> t)
 22.         eststo C: quietly mean nih_times100 if phase == 2 , over(year_star
> t)
 23.         eststo D: quietly mean nih_times100 if phase == 3 , over(year_star
> t)
 24. 
.         label variable nih_times100 " "
 25.         if "`table_path'" != "" local write_tex "using `table_path'"
 26.         esttab A B C D `write_tex', ///
>                         replace ///
>                         title("Percent of trials receiving NIH funding by pha
> se") ///
>                         mtitle("Phase I-III" "Phase I" "Phase II" "Phase III"
> ) ///
>                         coeflabels(`labels') ///
>                         collabels("Number of trials" "Percent funded", lhs("S
> tart year")) ///
>                         not nostar nogaps nonum ///
>                         scalars(N) ///
>                         compress  label ///
>                         cells("_N(fmt(%8.0gc)) b(fmt(1))" ) ///
>                         
 27.         restore 
 28. end

. 
. 
. 
. 
. 
. 
end of do-file

. 
. *Generate tables
. nih_funding_by_bmkr,            table_path("`finished_table_dir'/01-nih_fundi
> ng_by_bmkr.tex")
(output written to reports/report_7-25-17/tables/finished/01-nih_funding_by_bmk
> r.tex)

. nih_funding_by_bmkr_us,         table_path("`interim_table_dir'/02-nih_fundin
> g_by_bmkr_us.tex")
(output written to reports/report_7-25-17/tables/interim/02-nih_funding_by_bmkr
> _us.tex)
(output written to reports/report_7-25-17/tables/interim/02-nih_funding_by_bmkr
> _us.tex)

. nih_funding_by_bmkr_phase,      table_path("`interim_table_dir'/03-nih_fundin
> g_by_bmkr_phase.tex")
(output written to reports/report_7-25-17/tables/interim/03-nih_funding_by_bmkr
> _phase.tex)
(output written to reports/report_7-25-17/tables/interim/03-nih_funding_by_bmkr
> _phase.tex)

. nih_funding_by_bmkrrole,        table_path("`finished_table_dir'/04-nih_fundi
> ng_by_bmkrrole.tex")
(output written to reports/report_7-25-17/tables/finished/04-nih_funding_by_bmk
> rrole.tex)

. trial_phase,                    table_path("`finished_table_dir'/05-trial_pha
> se.tex")
(output written to reports/report_7-25-17/tables/finished/05-trial_phase.tex)

. trial_duration_by_yr,           table_path("`finished_table_dir'/06-trial_dur
> ation_by_yr.tex") ///
>                                         figure_path("`figure_dir'/06-trial_du
> ration_by_yr.eps")
(73,333 observations deleted)
(73,657 missing values generated)
(24,858 real changes made)
(29,961 real changes made)
(18,838 real changes made)

  Variables that uniquely identify margins: year_end
(file reports/report_7-25-17/figures/06-trial_duration_by_yr.eps written in EPS
>  format)
(output written to reports/report_7-25-17/tables/finished/06-trial_duration_by_
> yr.tex)

. nih_funding_means,              table_path("`finished_table_dir'/07-nih_fundi
> ng_means.tex")
(output written to reports/report_7-25-17/tables/finished/07-nih_funding_means.
> tex)

. trial_duration_by_yr_phase,     figure_path("`figure_dir'/05-trial_duration_b
> y_yr_phase.eps")
(73,333 observations deleted)
(73,657 missing values generated)
(24,858 real changes made)
(29,961 real changes made)
(18,838 real changes made)

  Variables that uniquely identify margins: year_end phase
(file reports/report_7-25-17/figures/05-trial_duration_by_yr_phase.eps written 
> in EPS format)

Average trial duration in months
-------------------------------------------------------------------------------
> ---------------------------------------------
                     All trials~a                   Phase I                  Ph
> ase II                 Phase III             
End year             Number of ~s Average du~n Number of ~s Average du~n Number
>  of ~s Average du~n Number of ~s Average du~n
-------------------------------------------------------------------------------
> ---------------------------------------------
                                                                               
>                                              
2000                          522         26.4          186         22.0       
>    169         28.9          167         28.7
2001                          653         28.8          245         26.0       
>    216         31.3          192         29.5
2002                          913         27.5          328         22.8       
>    323         32.3          262         27.5
2003                        1,305         26.7          360         20.1       
>    488         30.8          457         27.5
2004                        1,723         28.4          469         22.1       
>    640         32.5          614         28.8
2005                        2,398         28.6          576         22.9       
>    949         32.3          873         28.3
2006                        3,178         28.5          805         22.2       
>  1,309         31.4        1,064         29.7
2007                        4,115         28.8        1,119         22.6       
>  1,720         32.3        1,276         29.6
2008                        4,985         27.4        1,504         20.4       
>  2,039         30.4        1,442         30.3
2009                        5,586         28.8        1,919         21.6       
>  2,208         33.3        1,459         31.2
2010                        5,744         29.6        1,991         22.3       
>  2,375         34.1        1,378         32.6
2011                        6,159         30.4        2,230         23.5       
>  2,516         34.7        1,413         33.7
2012                        6,571         32.2        2,345         25.1       
>  2,656         35.9        1,570         36.7
2013                        6,501         32.7        2,241         27.6       
>  2,660         35.8        1,600         34.5
2014                        7,082         31.9        2,452         25.4       
>  2,993         35.9        1,637         34.4
2015                        6,931         34.2        2,375         28.0       
>  2,908         37.6        1,648         36.9
2016                        7,719         34.2        2,672         27.8       
>  3,425         37.3        1,622         38.4
-------------------------------------------------------------------------------
> ---------------------------------------------
Observations                72085                     23817                    
>  29594                     18674             
-------------------------------------------------------------------------------
> ---------------------------------------------

. trial_duration_by_yr_bmkr,      table_path("`finished_table_dir'/11-trial_dur
> ation_by_yr_bmkr.tex") ///
>                                         figure_path("`figure_dir'/04-trial_du
> ration_by_yr_bmkr.eps")
command prep_duration is unrecognized
r(199);

end of do-file
r(199);
