
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   14.2   Copyright 1985-2015 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

18-user 8-core Stata network perpetual license:
       Serial number:  501406201034
         Licensed to:  National Bureau of Economic Research
                       Cambridge, MA 02138

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.


running /disk/admin/Linux-local/stata14/sysprofile.do ...

. do 3_Summary_Statistics_P2_Data.do 

. /****************************************************************************
> *******
> File        : 2_Summary_Statistics_P2_Data.do
> Authors     : A. Ndikumana & A. D. Stern
> Created     : 17 Aug 2016
> Modified    : 19 Sep 2016
> Description : creates summary statistics from P2 clinical trial starts from 1
> 995 - 2015
> *****************************************************************************
> ******/
. 
. do setup.do

. global raw = "../data/raw"

. global interim = "../data/interim"

. global processed = "../data/processed"

. 
end of do-file

. 
. use "$processed/clinical-trials.dta", clear

. 
. 
. * Number of observations
. count
  42,591

. 
. * table of clinical trials per year
. table start_year

----------------------
Start     |
Year      |      Freq.
----------+-----------
     1995 |        295
     1996 |        351
     1997 |        472
     1998 |        653
     1999 |        886
     2000 |        972
     2001 |      1,121
     2002 |      1,416
     2003 |      1,593
     2004 |      2,004
     2005 |      2,547
     2006 |      2,764
     2007 |      2,932
     2008 |      2,972
     2009 |      3,105
     2010 |      3,043
     2011 |      3,149
     2012 |      3,245
     2013 |      3,068
     2014 |      2,843
     2015 |      3,160
----------------------

. 
. * table of clinical trials with and without biomarkers per year
. table start_year  biomarker_included

------------------------
          |  Biomarker  
Start     |   Included  
Year      |     0      1
----------+-------------
     1995 |   266     29
     1996 |   312     39
     1997 |   422     50
     1998 |   565     88
     1999 |   767    119
     2000 |   794    178
     2001 |   900    221
     2002 | 1,111    305
     2003 | 1,210    383
     2004 | 1,464    540
     2005 | 1,868    679
     2006 | 1,929    835
     2007 | 1,936    996
     2008 | 1,910  1,062
     2009 | 1,859  1,246
     2010 | 1,663  1,380
     2011 | 1,673  1,476
     2012 | 1,618  1,627
     2013 | 1,492  1,576
     2014 | 1,272  1,571
     2015 | 1,295  1,865
------------------------

. 
. * table of frequency of each biomarker role, overall and per year
. 
. local roles disease_biomarke_role therapeutic_effect_biomarke_role toxic_effe
> ct_biomarke_role not_determined_biomarke_role

. foreach r of local roles {
  2. 
. table `r' if biomarker_included==1
  3. 
. }

----------------------
Disease   |
Biomarker |
Role      |      Freq.
----------+-----------
        0 |     12,470
        1 |      3,795
----------------------

----------------------
Therapeut |
ic Effect |
Biomarker |
Role      |      Freq.
----------+-----------
        0 |      2,998
        1 |     13,267
----------------------

----------------------
Toxic     |
Effect    |
Biomarker |
Role      |      Freq.
----------+-----------
        0 |     14,871
        1 |      1,394
----------------------

----------------------
Not       |
Determine |
d         |
Biomarker |
Role      |      Freq.
----------+-----------
        0 |     16,197
        1 |         68
----------------------

. 
. local roles disease_biomarke_role therapeutic_effect_biomarke_role toxic_effe
> ct_biomarke_role not_determined_biomarke_role

. foreach r of local roles {
  2. 
. table start_year `r' if biomarker_included==1
  3. 
. }

------------------------
          |   Disease   
          |  Biomarker  
Start     |     Role    
Year      |     0      1
----------+-------------
     1995 |    25      4
     1996 |    32      7
     1997 |    39     11
     1998 |    68     20
     1999 |    93     26
     2000 |   133     45
     2001 |   176     45
     2002 |   242     63
     2003 |   299     84
     2004 |   428    112
     2005 |   547    132
     2006 |   682    153
     2007 |   783    213
     2008 |   844    218
     2009 |   951    295
     2010 | 1,068    312
     2011 | 1,110    366
     2012 | 1,227    400
     2013 | 1,151    425
     2014 | 1,208    363
     2015 | 1,364    501
------------------------

------------------------
          | Therapeutic 
          |    Effect   
          |  Biomarker  
Start     |     Role    
Year      |     0      1
----------+-------------
     1995 |     2     27
     1996 |     7     32
     1997 |    10     40
     1998 |    16     72
     1999 |    23     96
     2000 |    37    141
     2001 |    38    183
     2002 |    56    249
     2003 |    69    314
     2004 |    94    446
     2005 |   105    574
     2006 |   126    709
     2007 |   141    855
     2008 |   178    884
     2009 |   233  1,013
     2010 |   250  1,130
     2011 |   291  1,185
     2012 |   327  1,300
     2013 |   312  1,264
     2014 |   293  1,278
     2015 |   390  1,475
------------------------

------------------------
          | Toxic Effect
          |  Biomarker  
Start     |     Role    
Year      |     0      1
----------+-------------
     1995 |    28      1
     1996 |    38      1
     1997 |    49      1
     1998 |    87      1
     1999 |   117      2
     2000 |   174      4
     2001 |   213      8
     2002 |   295     10
     2003 |   364     19
     2004 |   517     23
     2005 |   639     40
     2006 |   787     48
     2007 |   936     60
     2008 |   981     81
     2009 | 1,127    119
     2010 | 1,253    127
     2011 | 1,322    154
     2012 | 1,465    162
     2013 | 1,408    168
     2014 | 1,405    166
     2015 | 1,666    199
------------------------

------------------------
          |     Not     
          |  Determined 
          |  Biomarker  
Start     |     Role    
Year      |     0      1
----------+-------------
     1995 |    29       
     1996 |    39       
     1997 |    50       
     1998 |    88       
     1999 |   119       
     2000 |   177      1
     2001 |   220      1
     2002 |   305       
     2003 |   382      1
     2004 |   536      4
     2005 |   676      3
     2006 |   832      3
     2007 |   995      1
     2008 | 1,058      4
     2009 | 1,242      4
     2010 | 1,377      3
     2011 | 1,471      5
     2012 | 1,617     10
     2013 | 1,571      5
     2014 | 1,563      8
     2015 | 1,850     15
------------------------

. 
. * table of frequency of each biomarker type, overall and per year
. 
. local types genomic_biomarker_type proteomic_biomarker_type biochemical_bioma
> rker_type cellular_biomarker_type physiological_biomarker_type structural_bio
> marker_type anthropomorphic_biomarker_type

. foreach t of local types {
  2. 
. table `t' if biomarker_included==1
  3. 
. }

----------------------
Genomic   |
Biomarker |
Type      |      Freq.
----------+-----------
        0 |      5,415
        1 |     10,850
----------------------

----------------------
Proteomic |
Biomarker |
Type      |      Freq.
----------+-----------
        0 |      4,951
        1 |     11,314
----------------------

----------------------
Biochemic |
al        |
Biomarker |
Type      |      Freq.
----------+-----------
        0 |     11,533
        1 |      4,732
----------------------

----------------------
Cellular  |
Biomarker |
Type      |      Freq.
----------+-----------
        0 |     13,615
        1 |      2,650
----------------------

----------------------
Physiolog |
ical      |
Biomarker |
Type      |      Freq.
----------+-----------
        0 |     12,027
        1 |      4,238
----------------------

----------------------
Structura |
l         |
Biomarker |
Type      |      Freq.
----------+-----------
        0 |     15,044
        1 |      1,221
----------------------

----------------------
Anthropom |
orphic    |
Biomarker |
Type      |      Freq.
----------+-----------
        0 |     15,055
        1 |      1,210
----------------------

. 
. local types genomic_biomarker_type proteomic_biomarker_type biochemical_bioma
> rker_type cellular_biomarker_type physiological_biomarker_type structural_bio
> marker_type anthropomorphic_biomarker_type

. foreach t of local types {
  2. 
. table start_year `t' if biomarker_included==1
  3. 
. }

------------------------
          |   Genomic   
          |  Biomarker  
Start     |     Type    
Year      |     0      1
----------+-------------
     1995 |    15     14
     1996 |    10     29
     1997 |    18     32
     1998 |    32     56
     1999 |    31     88
     2000 |    48    130
     2001 |    63    158
     2002 |    80    225
     2003 |   119    264
     2004 |   134    406
     2005 |   212    467
     2006 |   250    585
     2007 |   284    712
     2008 |   357    705
     2009 |   378    868
     2010 |   454    926
     2011 |   472  1,004
     2012 |   565  1,062
     2013 |   542  1,034
     2014 |   610    961
     2015 |   741  1,124
------------------------

------------------------
          |  Proteomic  
          |  Biomarker  
Start     |     Type    
Year      |     0      1
----------+-------------
     1995 |    13     16
     1996 |     7     32
     1997 |    13     37
     1998 |    21     67
     1999 |    27     92
     2000 |    39    139
     2001 |    49    172
     2002 |    66    239
     2003 |    96    287
     2004 |   122    418
     2005 |   191    488
     2006 |   203    632
     2007 |   260    736
     2008 |   316    746
     2009 |   352    894
     2010 |   423    957
     2011 |   436  1,040
     2012 |   540  1,087
     2013 |   498  1,078
     2014 |   583    988
     2015 |   696  1,169
------------------------

------------------------
          | Biochemical 
          |  Biomarker  
Start     |     Type    
Year      |     0      1
----------+-------------
     1995 |    22      7
     1996 |    29     10
     1997 |    33     17
     1998 |    71     17
     1999 |    86     33
     2000 |   128     50
     2001 |   158     63
     2002 |   227     78
     2003 |   275    108
     2004 |   400    140
     2005 |   506    173
     2006 |   609    226
     2007 |   712    284
     2008 |   751    311
     2009 |   867    379
     2010 |   987    393
     2011 | 1,030    446
     2012 | 1,139    488
     2013 | 1,105    471
     2014 | 1,074    497
     2015 | 1,324    541
------------------------

------------------------
          |   Cellular  
          |  Biomarker  
Start     |     Type    
Year      |     0      1
----------+-------------
     1995 |    27      2
     1996 |    35      4
     1997 |    45      5
     1998 |    83      5
     1999 |    97     22
     2000 |   161     17
     2001 |   192     29
     2002 |   275     30
     2003 |   341     42
     2004 |   474     66
     2005 |   588     91
     2006 |   715    120
     2007 |   848    148
     2008 |   877    185
     2009 | 1,042    204
     2010 | 1,155    225
     2011 | 1,235    241
     2012 | 1,330    297
     2013 | 1,293    283
     2014 | 1,288    283
     2015 | 1,514    351
------------------------

------------------------
          |Physiological
          |  Biomarker  
Start     |     Type    
Year      |     0      1
----------+-------------
     1995 |    21      8
     1996 |    38      1
     1997 |    45      5
     1998 |    74     14
     1999 |   106     13
     2000 |   162     16
     2001 |   190     31
     2002 |   268     37
     2003 |   319     64
     2004 |   466     74
     2005 |   531    148
     2006 |   680    155
     2007 |   794    202
     2008 |   834    228
     2009 |   933    313
     2010 | 1,026    354
     2011 | 1,104    372
     2012 | 1,145    482
     2013 | 1,088    488
     2014 | 1,026    545
     2015 | 1,177    688
------------------------

------------------------
          |  Structural 
          |  Biomarker  
Start     |     Type    
Year      |     0      1
----------+-------------
     1995 |    29       
     1996 |    38      1
     1997 |    49      1
     1998 |    83      5
     1999 |   116      3
     2000 |   175      3
     2001 |   214      7
     2002 |   298      7
     2003 |   372     11
     2004 |   525     15
     2005 |   656     23
     2006 |   799     36
     2007 |   929     67
     2008 | 1,010     52
     2009 | 1,164     82
     2010 | 1,285     95
     2011 | 1,378     98
     2012 | 1,482    145
     2013 | 1,431    145
     2014 | 1,405    166
     2015 | 1,606    259
------------------------

------------------------
          |Anthropomorph
          | ic Biomarker
Start     |     Type    
Year      |     0      1
----------+-------------
     1995 |    28      1
     1996 |    39       
     1997 |    46      4
     1998 |    83      5
     1999 |   116      3
     2000 |   171      7
     2001 |   212      9
     2002 |   295     10
     2003 |   366     17
     2004 |   516     24
     2005 |   642     37
     2006 |   795     40
     2007 |   936     60
     2008 |   990     72
     2009 | 1,164     82
     2010 | 1,279    101
     2011 | 1,362    114
     2012 | 1,488    139
     2013 | 1,428    148
     2014 | 1,416    155
     2015 | 1,683    182
------------------------

. 
. *the way "nih_yes" is currently coded is not complete...as a stopgap:
. gen nih_funded = 1 if nih_yes==1
(40,991 missing values generated)

. 
. sum us_trial

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    us_trial |     42,591    .4129981    .4923783          0          1

. table nih_funded biomarker_included if us_trial==1

----------------------
          | Biomarker 
nih_funde |  Included 
d         |    0     1
----------+-----------
        1 |  769   739
----------------------

. 
. 
end of do-file
