--------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /disk/homedirs/nber/bergerb/cortellis_projects/clinical_trials/reports/regression_output_10-20-17/regression_output_10-20-17.lo
> g
  log type:  text
 opened on:  20 Oct 2017, 14:01:39

. 
. * ------------------------------*
. * Main PPM regressions (Table 7)
. * ------------------------------*
. ppm_regs, ppm(g_ppm) estimator(regress) quietly 
Dependent variable: g_ppm

                    &       reg1a   &       reg1b   &       reg1c   &       reg1d   \\
                    &        b/se   &        b/se   &        b/se   &        b/se   \\
Trial start year    &      0.0038*  &      0.0038*  &      0.0049   &      0.0049   \\
                    &    (0.0014)   &    (0.0014)   &    (0.0024)   &    (0.0024)   \\
Phase 2 Clinical (includes Phase 2/Phase 3 trials)&      0.0091   &      0.0091   &      0.0115   &      0.0119   \\
                    &    (0.0094)   &    (0.0092)   &    (0.0106)   &    (0.0104)   \\
Phase 3 Clinical    &      0.0175   &      0.0176   &      0.0198   &      0.0203   \\
                    &    (0.0147)   &    (0.0145)   &    (0.0163)   &    (0.0160)   \\
Trial site in US=1  &      0.0139***&      0.0134** &      0.0151***&      0.0106** \\
                    &    (0.0021)   &    (0.0036)   &    (0.0024)   &    (0.0036)   \\
Drug indication for neoplasm=1&      0.1370***&      0.1364***&      0.1503***&      0.1445***\\
                    &    (0.0149)   &    (0.0121)   &    (0.0186)   &    (0.0135)   \\
NIH funding         &      0.0077   &      0.0076   &      0.0052   &      0.0033   \\
                    &    (0.0071)   &    (0.0066)   &    (0.0094)   &    (0.0080)   \\
Biomarker type: genomic=1&      0.2448*  &      0.2447*  &      0.2424*  &      0.2420*  \\
                    &    (0.1109)   &    (0.1111)   &    (0.1138)   &    (0.1141)   \\
Trial site in US=1 $\times$ Drug indication for neoplasm=1&               &      0.0014   &               &      0.0136   \\
                    &               &    (0.0075)   &               &    (0.0128)   \\
Constant            &     -7.7110*  &     -7.7139*  &     -9.9980   &     -9.9795   \\
                    &    (2.9010)   &    (2.8872)   &    (4.8334)   &    (4.8447)   \\
N                   &      107430   &      107430   &       91371   &       91371   \\
r2                  &       0.272   &       0.272   &       0.279   &       0.279   \\
* p<0.05, ** p<0.01, *** p<0.001

. ppm_regs, ppm(r_ppm) estimator(regress) quietly
Dependent variable: r_ppm

                    &       reg1a   &       reg1b   &       reg1c   &       reg1d   \\
                    &        b/se   &        b/se   &        b/se   &        b/se   \\
Trial start year    &      0.0034*  &      0.0034*  &      0.0043   &      0.0043   \\
                    &    (0.0014)   &    (0.0014)   &    (0.0023)   &    (0.0023)   \\
Phase 2 Clinical (includes Phase 2/Phase 3 trials)&      0.0119   &      0.0121   &      0.0142   &      0.0147   \\
                    &    (0.0099)   &    (0.0097)   &    (0.0113)   &    (0.0111)   \\
Phase 3 Clinical    &      0.0223   &      0.0225   &      0.0244   &      0.0250   \\
                    &    (0.0156)   &    (0.0154)   &    (0.0174)   &    (0.0172)   \\
Trial site in US=1  &      0.0107***&      0.0092** &      0.0112***&      0.0058*  \\
                    &    (0.0017)   &    (0.0029)   &    (0.0017)   &    (0.0025)   \\
Drug indication for neoplasm=1&      0.1356***&      0.1337***&      0.1487***&      0.1418***\\
                    &    (0.0141)   &    (0.0113)   &    (0.0176)   &    (0.0126)   \\
NIH funding         &      0.0052   &      0.0048   &      0.0044   &      0.0021   \\
                    &    (0.0069)   &    (0.0065)   &    (0.0085)   &    (0.0073)   \\
Biomarker type: genomic=1&      0.2200   &      0.2199   &      0.2171   &      0.2166   \\
                    &    (0.1092)   &    (0.1093)   &    (0.1118)   &    (0.1121)   \\
Trial site in US=1 $\times$ Drug indication for neoplasm=1&               &      0.0041   &               &      0.0163   \\
                    &               &    (0.0070)   &               &    (0.0121)   \\
Constant            &     -6.9088*  &     -6.9176*  &     -8.6506   &     -8.6283   \\
                    &    (2.8502)   &    (2.8393)   &    (4.6457)   &    (4.6548)   \\
N                   &      107430   &      107430   &       91371   &       91371   \\
r2                  &       0.254   &       0.254   &       0.262   &       0.262   \\
* p<0.05, ** p<0.01, *** p<0.001

. 
. * ------------------------------*
. * Duration regressions (Table 8)
. * ------------------------------*
. duration_regs, end_dates("actual")
(7,269 observations deleted)
actual
(65,275 observations deleted)

Linear regression                               Number of obs     =     52,929
                                                F(22, 52906)      =    1366.47
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3141
                                                Root MSE          =     21.661

------------------------------------------------------------------------------
             |               Robust
  duration_w |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  year_start |
       2001  |  -2.060548   1.607388    -1.28   0.200    -5.211043    1.089946
       2002  |  -8.358876   1.471189    -5.68   0.000    -11.24242   -5.475331
       2003  |  -9.546497   1.415603    -6.74   0.000    -12.32109   -6.771903
       2004  |   -12.6612   1.349583    -9.38   0.000    -15.30639     -10.016
       2005  |  -15.65537   1.318745   -11.87   0.000    -18.24012   -13.07062
       2006  |   -17.3296   1.297921   -13.35   0.000    -19.87353   -14.78566
       2007  |  -19.51146   1.285646   -15.18   0.000    -22.03133   -16.99158
       2008  |  -20.81921   1.279057   -16.28   0.000    -23.32617   -18.31225
       2009  |   -21.9624   1.272192   -17.26   0.000    -24.45591   -19.46889
       2010  |   -23.6155   1.269823   -18.60   0.000    -26.10437   -21.12664
       2011  |  -25.17617   1.263362   -19.93   0.000    -27.65237   -22.69997
       2012  |   -26.5616   1.262166   -21.04   0.000    -29.03546   -24.08774
       2013  |  -28.69397   1.259764   -22.78   0.000    -31.16312   -26.22482
       2014  |  -32.04998   1.256596   -25.51   0.000    -34.51291   -29.58704
       2015  |  -35.33997   1.257286   -28.11   0.000    -37.80427   -32.87568
       2016  |  -37.52406   1.262296   -29.73   0.000    -39.99817   -35.04995
             |
     phase_2 |   6.616481   .2200428    30.07   0.000     6.185195    7.047767
     phase_3 |   9.020838   .2548776    35.39   0.000     8.521275      9.5204
    us_trial |   3.563862    .187838    18.97   0.000     3.195698    3.932026
    neoplasm |   19.14578   .2658797    72.01   0.000     18.62466    19.66691
 nih_funding |   14.23701   .6921737    20.57   0.000     12.88035    15.59368
       g_ppm |   7.694216   .5351862    14.38   0.000     6.645246    8.743185
       _cons |   37.76518   1.259714    29.98   0.000     35.29613    40.23423
------------------------------------------------------------------------------

Linear regression                               Number of obs     =     27,861
                                                F(21, 27839)      =     808.82
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2860
                                                Root MSE          =     23.744

------------------------------------------------------------------------------
             |               Robust
  duration_w |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  year_start |
       2001  |  -1.681769   1.875499    -0.90   0.370    -5.357839      1.9943
       2002  |  -8.952548   1.727097    -5.18   0.000    -12.33774   -5.567353
       2003  |  -9.423908   1.672588    -5.63   0.000    -12.70226   -6.145554
       2004  |  -12.08757   1.585994    -7.62   0.000    -15.19619   -8.978941
       2005  |   -15.7884   1.535528   -10.28   0.000    -18.79811   -12.77869
       2006  |  -16.73296   1.510425   -11.08   0.000    -19.69347   -13.77245
       2007  |  -19.72268   1.490502   -13.23   0.000    -22.64414   -16.80123
       2008  |   -21.2907    1.48024   -14.38   0.000    -24.19204   -18.38936
       2009  |  -22.99623   1.471134   -15.63   0.000    -25.87973   -20.11274
       2010  |  -24.42314   1.468827   -16.63   0.000    -27.30212   -21.54417
       2011  |  -26.36117   1.456666   -18.10   0.000    -29.21631   -23.50603
       2012  |  -27.81466   1.459057   -19.06   0.000    -30.67449   -24.95484
       2013  |  -30.61005   1.451444   -21.09   0.000    -33.45495   -27.76515
       2014  |  -34.38577   1.442583   -23.84   0.000     -37.2133   -31.55823
       2015  |  -38.40861   1.445955   -26.56   0.000    -41.24275   -35.57447
       2016  |  -41.03297   1.456624   -28.17   0.000    -43.88803   -38.17792
             |
     phase_2 |   5.299282   .3319582    15.96   0.000     4.648628    5.949937
     phase_3 |   6.132198   .3966094    15.46   0.000     5.354824    6.909572
    neoplasm |   17.81054   .3694356    48.21   0.000     17.08643    18.53466
 nih_funding |   13.95235   .7055694    19.77   0.000      12.5694     15.3353
       g_ppm |   8.078334   .6911366    11.69   0.000     6.723672    9.432996
       _cons |    43.6874   1.444213    30.25   0.000     40.85667    46.51813
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      9,315
                                                F(20, 9294)       =     252.48
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1790
                                                Root MSE          =      26.95

------------------------------------------------------------------------------
             |               Robust
  duration_w |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  year_start |
       2001  |   2.748906    2.42547     1.13   0.257    -2.005547    7.503358
       2002  |  -3.021752   2.299119    -1.31   0.189    -7.528529    1.485025
       2003  |   -5.22083   2.241006    -2.33   0.020    -9.613693   -.8279673
       2004  |  -6.284263   2.129141    -2.95   0.003    -10.45785   -2.110681
       2005  |  -10.72843   2.037939    -5.26   0.000    -14.72324   -6.733626
       2006  |  -10.32383   1.989089    -5.19   0.000    -14.22288    -6.42478
       2007  |  -14.78427   1.950264    -7.58   0.000    -18.60722   -10.96133
       2008  |    -16.569   1.952813    -8.48   0.000    -20.39694   -12.74106
       2009  |  -18.46317    1.92152    -9.61   0.000    -22.22977   -14.69657
       2010  |  -23.51774   1.919763   -12.25   0.000     -27.2809   -19.75459
       2011  |  -26.81257   1.899953   -14.11   0.000    -30.53689   -23.08824
       2012  |  -31.26222   1.918565   -16.29   0.000    -35.02303   -27.50141
       2013  |  -36.70091   1.892723   -19.39   0.000    -40.41106   -32.99075
       2014  |  -43.99696   1.877482   -23.43   0.000    -47.67724   -40.31668
       2015  |  -51.23468   1.902225   -26.93   0.000    -54.96346    -47.5059
       2016  |  -55.80627   2.228657   -25.04   0.000    -60.17492   -51.43761
             |
     phase_2 |   2.246085   .5741036     3.91   0.000     1.120716    3.371454
     phase_3 |   9.223385   1.255462     7.35   0.000     6.762404    11.68437
 nih_funding |   9.759794   .9940841     9.82   0.000     7.811171    11.70842
       g_ppm |   8.671015   .7649947    11.33   0.000     7.171458    10.17057
       _cons |   60.25005   1.786937    33.72   0.000     56.74726    63.75284
------------------------------------------------------------------------------
(0 real changes made)

Linear regression                               Number of obs     =      8,443
                                                F(36, 8406)       =     122.41
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1930
                                                Root MSE          =     26.721

---------------------------------------------------------------------------------------------
                            |               Robust
                 duration_w |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
                 year_start |
                      2001  |   2.220413   2.434324     0.91   0.362     -2.55146    6.992287
                      2002  |  -3.416828    2.33353    -1.46   0.143    -7.991121    1.157464
                      2003  |  -6.221021   2.256848    -2.76   0.006      -10.645   -1.797043
                      2004  |  -7.960312   2.143196    -3.71   0.000     -12.1615   -3.759121
                      2005  |  -12.35121   2.046531    -6.04   0.000    -16.36292   -8.339506
                      2006  |  -12.38283   1.991471    -6.22   0.000    -16.28661   -8.479059
                      2007  |  -16.89671   1.963226    -8.61   0.000    -20.74511    -13.0483
                      2008  |  -18.96573   1.959122    -9.68   0.000    -22.80609   -15.12537
                      2009  |  -20.79535   1.941134   -10.71   0.000    -24.60045   -16.99025
                      2010  |  -26.18235   1.933393   -13.54   0.000    -29.97228   -22.39242
                      2011  |  -29.82045   1.933729   -15.42   0.000    -33.61103   -26.02987
                      2012  |  -34.10974   1.941859   -17.57   0.000    -37.91626   -30.30321
                      2013  |  -39.75644   1.913932   -20.77   0.000    -43.50822   -36.00467
                      2014  |  -45.85326    1.89506   -24.20   0.000    -49.56804   -42.13847
                      2015  |  -52.64013   1.943797   -27.08   0.000    -56.45046   -48.82981
                      2016  |  -58.24078   2.461646   -23.66   0.000    -63.06621   -53.41534
                            |
                    phase_2 |   2.046544    .605223     3.38   0.001     .8601582     3.23293
                    phase_3 |   8.242711   1.291464     6.38   0.000     5.711123     10.7743
                nih_funding |   8.667777      1.046     8.29   0.000      6.61736    10.71819
            diagnosis_drole |   2.899602   1.489565     1.95   0.052    -.0203123    5.819516
       diff_diagnosis_drole |   3.968152   1.189855     3.33   0.001     1.635744    6.300559
   predict_resistance_drole |  -1.918807   1.289058    -1.49   0.137    -4.445677    .6080635
     predict_efficacy_drole |    4.81295   1.422612     3.38   0.001      2.02428    7.601621
     predict_toxicity_drole |  -.3697927   1.966994    -0.19   0.851    -4.225585       3.486
            screening_drole |   1.077925   1.591213     0.68   0.498    -2.041244    4.197095
selection_for_therapy_drole |   2.450881   1.215496     2.02   0.044     .0682088    4.833553
    disease_profiling_drole |   1.156645   1.120657     1.03   0.302    -1.040119    3.353408
  monitor_progression_drole |  -1.517978   1.501716    -1.01   0.312    -4.461711    1.425755
     monitor_efficacy_drole |    1.37752   1.201125     1.15   0.251    -.9769817    3.732021
     monitor_toxicity_drole |  -3.167588   2.547455    -1.24   0.214    -8.161227    1.826051
       not_determined_drole |  -.0037058    2.52671    -0.00   0.999     -4.95668    4.949268
            prognosis_drole |   .3461371   1.374216     0.25   0.801    -2.347664    3.039939
  prognosis_riskstrat_drole |   1.109958   1.757465     0.63   0.528    -2.335105    4.555021
          risk_factor_drole |   .1636433   1.153544     0.14   0.887    -2.097587    2.424874
              staging_drole |  -4.562299   1.323841    -3.45   0.001    -7.157353   -1.967244
   toxicity_profiling_drole |   7.605846   10.02417     0.76   0.448    -12.04399    27.25568
                      _cons |   59.35662   1.779714    33.35   0.000     55.86794     62.8453
---------------------------------------------------------------------------------------------

                    &       reg2a   &       reg2b   &       reg2c   &       reg2d   \\
                    &        b/se   &        b/se   &        b/se   &        b/se   \\
Trial start year=2000&       0.000   &       0.000   &       0.000   &       0.000   \\
                    &         (.)   &         (.)   &         (.)   &         (.)   \\
Trial start year=2001&      -2.061   &      -1.682   &       2.749   &       2.220   \\
                    &     (1.607)   &     (1.875)   &     (2.425)   &     (2.434)   \\
Trial start year=2002&      -8.359***&      -8.953***&      -3.022   &      -3.417   \\
                    &     (1.471)   &     (1.727)   &     (2.299)   &     (2.334)   \\
Trial start year=2003&      -9.546***&      -9.424***&      -5.221*  &      -6.221** \\
                    &     (1.416)   &     (1.673)   &     (2.241)   &     (2.257)   \\
Trial start year=2004&     -12.661***&     -12.088***&      -6.284** &      -7.960***\\
                    &     (1.350)   &     (1.586)   &     (2.129)   &     (2.143)   \\
Trial start year=2005&     -15.655***&     -15.788***&     -10.728***&     -12.351***\\
                    &     (1.319)   &     (1.536)   &     (2.038)   &     (2.047)   \\
Trial start year=2006&     -17.330***&     -16.733***&     -10.324***&     -12.383***\\
                    &     (1.298)   &     (1.510)   &     (1.989)   &     (1.991)   \\
Trial start year=2007&     -19.511***&     -19.723***&     -14.784***&     -16.897***\\
                    &     (1.286)   &     (1.491)   &     (1.950)   &     (1.963)   \\
Trial start year=2008&     -20.819***&     -21.291***&     -16.569***&     -18.966***\\
                    &     (1.279)   &     (1.480)   &     (1.953)   &     (1.959)   \\
Trial start year=2009&     -21.962***&     -22.996***&     -18.463***&     -20.795***\\
                    &     (1.272)   &     (1.471)   &     (1.922)   &     (1.941)   \\
Trial start year=2010&     -23.616***&     -24.423***&     -23.518***&     -26.182***\\
                    &     (1.270)   &     (1.469)   &     (1.920)   &     (1.933)   \\
Trial start year=2011&     -25.176***&     -26.361***&     -26.813***&     -29.820***\\
                    &     (1.263)   &     (1.457)   &     (1.900)   &     (1.934)   \\
Trial start year=2012&     -26.562***&     -27.815***&     -31.262***&     -34.110***\\
                    &     (1.262)   &     (1.459)   &     (1.919)   &     (1.942)   \\
Trial start year=2013&     -28.694***&     -30.610***&     -36.701***&     -39.756***\\
                    &     (1.260)   &     (1.451)   &     (1.893)   &     (1.914)   \\
Trial start year=2014&     -32.050***&     -34.386***&     -43.997***&     -45.853***\\
                    &     (1.257)   &     (1.443)   &     (1.877)   &     (1.895)   \\
Trial start year=2015&     -35.340***&     -38.409***&     -51.235***&     -52.640***\\
                    &     (1.257)   &     (1.446)   &     (1.902)   &     (1.944)   \\
Trial start year=2016&     -37.524***&     -41.033***&     -55.806***&     -58.241***\\
                    &     (1.262)   &     (1.457)   &     (2.229)   &     (2.462)   \\
Phase 2 Clinical (includes Phase 2/Phase 3 trials)&       6.616***&       5.299***&       2.246***&       2.047***\\
                    &     (0.220)   &     (0.332)   &     (0.574)   &     (0.605)   \\
Phase 3 Clinical    &       9.021***&       6.132***&       9.223***&       8.243***\\
                    &     (0.255)   &     (0.397)   &     (1.255)   &     (1.291)   \\
Trial site in US    &       3.564***&               &               &               \\
                    &     (0.188)   &               &               &               \\
Drug indication for neoplasm&      19.146***&      17.811***&               &               \\
                    &     (0.266)   &     (0.369)   &               &               \\
Received NIH funding&      14.237***&      13.952***&       9.760***&       8.668***\\
                    &     (0.692)   &     (0.706)   &     (0.994)   &     (1.046)   \\
Generous PPM        &       7.694***&       8.078***&       8.671***&               \\
                    &     (0.535)   &     (0.691)   &     (0.765)   &               \\
Biomarker role (detailed): diagnosis&               &               &               &       2.900   \\
                    &               &               &               &     (1.490)   \\
Biomarker role (detailed): differential diagnosis&               &               &               &       3.968***\\
                    &               &               &               &     (1.190)   \\
Biomarker role (detailed): predicting drug resistance&               &               &               &      -1.919   \\
                    &               &               &               &     (1.289)   \\
Biomarker role (detailed): predicting treatment efficacy&               &               &               &       4.813***\\
                    &               &               &               &     (1.423)   \\
Biomarker role (detailed): predicting treatment toxicity&               &               &               &      -0.370   \\
                    &               &               &               &     (1.967)   \\
Biomarker role (detailed): screening&               &               &               &       1.078   \\
                    &               &               &               &     (1.591)   \\
Biomarker role (detailed): selection for therapy&               &               &               &       2.451*  \\
                    &               &               &               &     (1.215)   \\
Biomarker role (detailed): disease profiling&               &               &               &       1.157   \\
                    &               &               &               &     (1.121)   \\
Biomarker role (detailed): monitoring disease progression&               &               &               &      -1.518   \\
                    &               &               &               &     (1.502)   \\
Biomarker role (detailed): monitoring treatment efficacy&               &               &               &       1.378   \\
                    &               &               &               &     (1.201)   \\
Biomarker role (detailed): monitoring treatment toxicity&               &               &               &      -3.168   \\
                    &               &               &               &     (2.547)   \\
Biomarker role (detailed): not determined&               &               &               &      -0.004   \\
                    &               &               &               &     (2.527)   \\
Biomarker role (detailed): prognosis&               &               &               &       0.346   \\
                    &               &               &               &     (1.374)   \\
Biomarker role (detailed): prognosis - risk stratification&               &               &               &       1.110   \\
                    &               &               &               &     (1.757)   \\
Biomarker role (detailed): risk factor&               &               &               &       0.164   \\
                    &               &               &               &     (1.154)   \\
Biomarker role (detailed): staging&               &               &               &      -4.562***\\
                    &               &               &               &     (1.324)   \\
Biomarker role (detailed): toxicity profiling&               &               &               &       7.606   \\
                    &               &               &               &    (10.024)   \\
Constant            &      37.765***&      43.687***&      60.250***&      59.357***\\
                    &     (1.260)   &     (1.444)   &     (1.787)   &     (1.780)   \\
N                   &       52929   &       27861   &        9315   &        8443   \\
r2                  &       0.314   &       0.286   &       0.179   &       0.193   \\
* p<0.05, ** p<0.01, *** p<0.001

. 
. 
. * ------------------------------*
. * Appendix reg table: (Table A11)
. * ------------------------------*
. ppm_regs, ppm(g_ppm) estimator(logit) margins quietly
Dependent variable: g_ppm

                    &       reg1a   &       reg1b   &       reg1c   &       reg1d   \\
                    &        b/se   &        b/se   &        b/se   &        b/se   \\
Trial start year    &      0.0029***&      0.0028***&      0.0044***&      0.0044***\\
                    &    (0.0002)   &    (0.0002)   &    (0.0003)   &    (0.0003)   \\
Phase 2 Clinical (includes Phase 2/Phase 3 trials)&      0.0117***&      0.0113** &      0.0142***&      0.0136***\\
                    &    (0.0032)   &    (0.0035)   &    (0.0032)   &    (0.0036)   \\
Phase 3 Clinical    &      0.0173*  &      0.0163*  &      0.0192** &      0.0182*  \\
                    &    (0.0068)   &    (0.0073)   &    (0.0069)   &    (0.0074)   \\
Trial site in US=1  &      0.0057   &      0.0055***&      0.0062   &      0.0062***\\
                    &    (0.0055)   &    (0.0016)   &    (0.0065)   &    (0.0019)   \\
Drug indication for neoplasm=1&      0.1205***&      0.1204***&      0.1291***&      0.1290***\\
                    &    (0.0036)   &    (0.0032)   &    (0.0040)   &    (0.0035)   \\
NIH funding         &     -0.0060***&     -0.0042***&     -0.0079***&     -0.0056***\\
                    &    (0.0015)   &    (0.0005)   &    (0.0016)   &    (0.0008)   \\
Biomarker type: genomic=1&      0.2042***&      0.2046***&      0.2023***&      0.2029***\\
                    &    (0.0071)   &    (0.0066)   &    (0.0080)   &    (0.0074)   \\
N                   &      107430   &      107430   &       91371   &       91371   \\
r2                  &               &               &               &               \\
* p<0.05, ** p<0.01, *** p<0.001

. ppm_regs, ppm(r_ppm) estimator(logit) margins quietly
Dependent variable: r_ppm

                    &       reg1a   &       reg1b   &       reg1c   &       reg1d   \\
                    &        b/se   &        b/se   &        b/se   &        b/se   \\
Trial start year    &      0.0024***&      0.0024***&      0.0037***&      0.0037***\\
                    &    (0.0002)   &    (0.0002)   &    (0.0002)   &    (0.0002)   \\
Phase 2 Clinical (includes Phase 2/Phase 3 trials)&      0.0138***&      0.0136***&      0.0160***&      0.0157***\\
                    &    (0.0019)   &    (0.0021)   &    (0.0018)   &    (0.0021)   \\
Phase 3 Clinical    &      0.0233***&      0.0227***&      0.0252***&      0.0245***\\
                    &    (0.0036)   &    (0.0040)   &    (0.0038)   &    (0.0042)   \\
Trial site in US=1  &      0.0029   &      0.0028** &      0.0028   &      0.0027*  \\
                    &    (0.0034)   &    (0.0010)   &    (0.0040)   &    (0.0011)   \\
Drug indication for neoplasm=1&      0.1199***&      0.1199***&      0.1285***&      0.1284***\\
                    &    (0.0021)   &    (0.0018)   &    (0.0023)   &    (0.0020)   \\
NIH funding         &     -0.0060***&     -0.0049***&     -0.0067***&     -0.0054***\\
                    &    (0.0015)   &    (0.0006)   &    (0.0015)   &    (0.0006)   \\
Biomarker type: genomic=1&      0.1808***&      0.1811***&      0.1783***&      0.1786***\\
                    &    (0.0043)   &    (0.0039)   &    (0.0048)   &    (0.0043)   \\
N                   &      107430   &      107430   &       91371   &       91371   \\
r2                  &               &               &               &               \\
* p<0.05, ** p<0.01, *** p<0.001

. 
. 
. 
. 
. log close
      name:  <unnamed>
       log:  /disk/homedirs/nber/bergerb/cortellis_projects/clinical_trials/reports/regression_output_10-20-17/regression_output_10-20-17.lo
> g
  log type:  text
 closed on:  20 Oct 2017, 14:07:54
--------------------------------------------------------------------------------------------------------------------------------------------
