----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /disk/homedirs/nber/bergerb/cortellis_projects/clinical_trials/reports/regression_output_08-28-17/regression_output_08-28-17.log
  log type:  text
 opened on:  28 Aug 2017, 17:31:32

. 
. * ------------------------------*
. * Main PPM regressions (Table 7)
. * ------------------------------*
. 
. ppm_regs, ppm(g_ppm) estimator(regress) quietly 
Dependent variable: g_ppm

                    &       reg1a   &       reg1b   &       reg1c   &       reg1d   \\
                    &        b/se   &        b/se   &        b/se   &        b/se   \\
Trial start year    &      0.0038*  &      0.0038*  &      0.0050*  &      0.0050*  \\
                    &    (0.0013)   &    (0.0013)   &    (0.0022)   &    (0.0023)   \\
Phase 2 Clinical (includes Phase 2/Phase 3 trials)&      0.0056   &      0.0057   &      0.0071   &      0.0076   \\
                    &    (0.0074)   &    (0.0073)   &    (0.0085)   &    (0.0083)   \\
Phase 3 Clinical    &      0.0165   &      0.0166   &      0.0179   &      0.0183   \\
                    &    (0.0123)   &    (0.0122)   &    (0.0143)   &    (0.0142)   \\
Trial site in US=1  &      0.0137***&      0.0118*  &      0.0145***&      0.0086   \\
                    &    (0.0031)   &    (0.0047)   &    (0.0034)   &    (0.0051)   \\
Drug indication for neoplasm=1&      0.1399***&      0.1373***&      0.1543***&      0.1467***\\
                    &    (0.0160)   &    (0.0139)   &    (0.0194)   &    (0.0153)   \\
NIH funding         &      0.0154   &      0.0148   &      0.0129   &      0.0104   \\
                    &    (0.0129)   &    (0.0125)   &    (0.0195)   &    (0.0185)   \\
Biomarker type: genomic=1&      0.2524*  &      0.2523*  &      0.2488   &      0.2483   \\
                    &    (0.1155)   &    (0.1156)   &    (0.1184)   &    (0.1186)   \\
Trial site in US=1 $\times$ Drug indication for neoplasm=1&               &      0.0054   &               &      0.0176   \\
                    &               &    (0.0076)   &               &    (0.0119)   \\
Constant            &     -7.6653*  &     -7.6711*  &    -10.1589*  &    -10.1170*  \\
                    &    (2.7193)   &    (2.7144)   &    (4.5561)   &    (4.5675)   \\
N                   &       21428   &       21428   &       18207   &       18207   \\
r2                  &       0.280   &       0.280   &       0.287   &       0.287   \\
* p<0.05, ** p<0.01, *** p<0.001

. ppm_regs, ppm(r_ppm) estimator(regress) quietly
Dependent variable: r_ppm

                    &       reg1a   &       reg1b   &       reg1c   &       reg1d   \\
                    &        b/se   &        b/se   &        b/se   &        b/se   \\
Trial start year    &      0.0035*  &      0.0035*  &      0.0046   &      0.0046   \\
                    &    (0.0013)   &    (0.0013)   &    (0.0022)   &    (0.0022)   \\
Phase 2 Clinical (includes Phase 2/Phase 3 trials)&      0.0092   &      0.0093   &      0.0110   &      0.0116   \\
                    &    (0.0079)   &    (0.0078)   &    (0.0092)   &    (0.0091)   \\
Phase 3 Clinical    &      0.0225   &      0.0227   &      0.0240   &      0.0244   \\
                    &    (0.0133)   &    (0.0132)   &    (0.0155)   &    (0.0154)   \\
Trial site in US=1  &      0.0129***&      0.0104*  &      0.0135***&      0.0069   \\
                    &    (0.0026)   &    (0.0038)   &    (0.0028)   &    (0.0040)   \\
Drug indication for neoplasm=1&      0.1382***&      0.1349***&      0.1522***&      0.1436***\\
                    &    (0.0155)   &    (0.0130)   &    (0.0189)   &    (0.0144)   \\
NIH funding         &      0.0130   &      0.0122   &      0.0114   &      0.0086   \\
                    &    (0.0092)   &    (0.0087)   &    (0.0133)   &    (0.0122)   \\
Biomarker type: genomic=1&      0.2290   &      0.2289   &      0.2255   &      0.2249   \\
                    &    (0.1133)   &    (0.1135)   &    (0.1161)   &    (0.1163)   \\
Trial site in US=1 $\times$ Drug indication for neoplasm=1&               &      0.0071   &               &      0.0198   \\
                    &               &    (0.0073)   &               &    (0.0117)   \\
Constant            &     -7.1421*  &     -7.1498*  &     -9.3612   &     -9.3139   \\
                    &    (2.6491)   &    (2.6447)   &    (4.5025)   &    (4.5126)   \\
N                   &       21428   &       21428   &       18207   &       18207   \\
r2                  &       0.264   &       0.265   &       0.272   &       0.272   \\
* p<0.05, ** p<0.01, *** p<0.001

. 
. * ------------------------------*
. * Duration regressions (Table 8)
. * ------------------------------*
. 
. /* ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ *\
>   Run programs here when final model specs are determined 
> \* ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ */ 
. 
. 
. * ------------------------------*
. * Appendix reg table: (Table A11)
. * ------------------------------*
. ppm_regs, ppm(g_ppm) estimator(logit) margins quietly
Dependent variable: g_ppm

                    &       reg1a   &       reg1b   &       reg1c   &       reg1d   \\
                    &        b/se   &        b/se   &        b/se   &        b/se   \\
Trial start year    &      0.0028***&      0.0027***&      0.0041***&      0.0041***\\
                    &    (0.0002)   &    (0.0002)   &    (0.0002)   &    (0.0002)   \\
Phase 2 Clinical (includes Phase 2/Phase 3 trials)&      0.0092** &      0.0088** &      0.0105** &      0.0099** \\
                    &    (0.0030)   &    (0.0032)   &    (0.0033)   &    (0.0036)   \\
Phase 3 Clinical    &      0.0147** &      0.0142** &      0.0175** &      0.0169** \\
                    &    (0.0050)   &    (0.0052)   &    (0.0062)   &    (0.0065)   \\
Trial site in US=1  &      0.0057   &      0.0054** &      0.0061   &      0.0059** \\
                    &    (0.0053)   &    (0.0019)   &    (0.0061)   &    (0.0023)   \\
Drug indication for neoplasm=1&      0.1233***&      0.1232***&      0.1330***&      0.1330***\\
                    &    (0.0030)   &    (0.0027)   &    (0.0034)   &    (0.0031)   \\
NIH funding         &     -0.0063** &     -0.0044   &     -0.0088** &     -0.0064   \\
                    &    (0.0024)   &    (0.0037)   &    (0.0033)   &    (0.0052)   \\
Biomarker type: genomic=1&      0.2102***&      0.2105***&      0.2083***&      0.2087***\\
                    &    (0.0082)   &    (0.0077)   &    (0.0088)   &    (0.0081)   \\
N                   &       21428   &       21428   &       18207   &       18207   \\
r2                  &               &               &               &               \\
* p<0.05, ** p<0.01, *** p<0.001

. ppm_regs, ppm(r_ppm) estimator(logit) margins quietly
Dependent variable: r_ppm

                    &       reg1a   &       reg1b   &       reg1c   &       reg1d   \\
                    &        b/se   &        b/se   &        b/se   &        b/se   \\
Trial start year    &      0.0025***&      0.0025***&      0.0037***&      0.0037***\\
                    &    (0.0001)   &    (0.0001)   &    (0.0001)   &    (0.0001)   \\
Phase 2 Clinical (includes Phase 2/Phase 3 trials)&      0.0121***&      0.0117***&      0.0137***&      0.0132***\\
                    &    (0.0013)   &    (0.0015)   &    (0.0015)   &    (0.0018)   \\
Phase 3 Clinical    &      0.0224***&      0.0219***&      0.0251***&      0.0246***\\
                    &    (0.0018)   &    (0.0018)   &    (0.0025)   &    (0.0027)   \\
Trial site in US=1  &      0.0052   &      0.0050** &      0.0053   &      0.0051** \\
                    &    (0.0049)   &    (0.0017)   &    (0.0054)   &    (0.0019)   \\
Drug indication for neoplasm=1&      0.1222***&      0.1221***&      0.1315***&      0.1315***\\
                    &    (0.0017)   &    (0.0015)   &    (0.0020)   &    (0.0017)   \\
NIH funding         &     -0.0067***&     -0.0051***&     -0.0086***&     -0.0066** \\
                    &    (0.0013)   &    (0.0015)   &    (0.0014)   &    (0.0021)   \\
Biomarker type: genomic=1&      0.1877***&      0.1879***&      0.1856***&      0.1858***\\
                    &    (0.0056)   &    (0.0051)   &    (0.0060)   &    (0.0054)   \\
N                   &       21428   &       21428   &       18207   &       18207   \\
r2                  &               &               &               &               \\
* p<0.05, ** p<0.01, *** p<0.001

. 
. 
. 
. log close
      name:  <unnamed>
       log:  /disk/homedirs/nber/bergerb/cortellis_projects/clinical_trials/reports/regression_output_08-28-17/regression_output_08-28-17.log
  log type:  text
 closed on:  28 Aug 2017, 17:32:25
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
