------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /disk/homedirs/nber/bergerb/cortellis_projects/clinical_trials/reports/regression_output_08-28-17/regression_output_08-28-17.log
  log type:  text
 opened on:  29 Aug 2017, 10:15:03

. 
. * ------------------------------*
. * Main PPM regressions (Table 7)
. * ------------------------------*
. 
. ppm_regs, ppm(g_ppm) estimator(regress) quietly 
Dependent variable: g_ppm

                    &       reg1a   &       reg1b   &       reg1c   &       reg1d   \\
                    &        b/se   &        b/se   &        b/se   &        b/se   \\
Trial start year    &      0.0038*  &      0.0038*  &      0.0050   &      0.0050   \\
                    &    (0.0014)   &    (0.0014)   &    (0.0024)   &    (0.0024)   \\
Phase 2 Clinical (includes Phase 2/Phase 3 trials)&      0.0092   &      0.0092   &      0.0116   &      0.0121   \\
                    &    (0.0095)   &    (0.0093)   &    (0.0108)   &    (0.0106)   \\
Phase 3 Clinical    &      0.0176   &      0.0177   &      0.0200   &      0.0204   \\
                    &    (0.0148)   &    (0.0146)   &    (0.0164)   &    (0.0162)   \\
Trial site in US=1  &      0.0139***&      0.0135** &      0.0151***&      0.0106** \\
                    &    (0.0021)   &    (0.0036)   &    (0.0024)   &    (0.0035)   \\
Drug indication for neoplasm=1&      0.1369***&      0.1363***&      0.1501***&      0.1444***\\
                    &    (0.0147)   &    (0.0120)   &    (0.0183)   &    (0.0134)   \\
NIH funding         &      0.0075   &      0.0074   &      0.0049   &      0.0030   \\
                    &    (0.0072)   &    (0.0067)   &    (0.0096)   &    (0.0083)   \\
Biomarker type: genomic=1&      0.2459*  &      0.2458*  &      0.2435*  &      0.2431*  \\
                    &    (0.1111)   &    (0.1113)   &    (0.1140)   &    (0.1142)   \\
Trial site in US=1 $\times$ Drug indication for neoplasm=1&               &      0.0013   &               &      0.0134   \\
                    &               &    (0.0071)   &               &    (0.0122)   \\
Constant            &     -7.7412*  &     -7.7440*  &    -10.0665   &    -10.0486   \\
                    &    (2.9287)   &    (2.9155)   &    (4.8983)   &    (4.9084)   \\
N                   &      106626   &      106626   &       90650   &       90650   \\
r2                  &       0.272   &       0.272   &       0.280   &       0.280   \\
* p<0.05, ** p<0.01, *** p<0.001

. ppm_regs, ppm(r_ppm) estimator(regress) quietly
Dependent variable: r_ppm

                    &       reg1a   &       reg1b   &       reg1c   &       reg1d   \\
                    &        b/se   &        b/se   &        b/se   &        b/se   \\
Trial start year    &      0.0034*  &      0.0034*  &      0.0043   &      0.0043   \\
                    &    (0.0014)   &    (0.0014)   &    (0.0023)   &    (0.0023)   \\
Phase 2 Clinical (includes Phase 2/Phase 3 trials)&      0.0120   &      0.0121   &      0.0143   &      0.0148   \\
                    &    (0.0100)   &    (0.0099)   &    (0.0115)   &    (0.0113)   \\
Phase 3 Clinical    &      0.0224   &      0.0226   &      0.0245   &      0.0251   \\
                    &    (0.0157)   &    (0.0155)   &    (0.0175)   &    (0.0173)   \\
Trial site in US=1  &      0.0107***&      0.0093** &      0.0113***&      0.0058*  \\
                    &    (0.0017)   &    (0.0029)   &    (0.0017)   &    (0.0024)   \\
Drug indication for neoplasm=1&      0.1355***&      0.1336***&      0.1486***&      0.1417***\\
                    &    (0.0140)   &    (0.0113)   &    (0.0175)   &    (0.0127)   \\
NIH funding         &      0.0050   &      0.0046   &      0.0042   &      0.0018   \\
                    &    (0.0070)   &    (0.0067)   &    (0.0086)   &    (0.0075)   \\
Biomarker type: genomic=1&      0.2210   &      0.2209   &      0.2182   &      0.2177   \\
                    &    (0.1094)   &    (0.1095)   &    (0.1120)   &    (0.1123)   \\
Trial site in US=1 $\times$ Drug indication for neoplasm=1&               &      0.0040   &               &      0.0162   \\
                    &               &    (0.0067)   &               &    (0.0116)   \\
Constant            &     -6.9385*  &     -6.9473*  &     -8.7166   &     -8.6950   \\
                    &    (2.8671)   &    (2.8567)   &    (4.6994)   &    (4.7075)   \\
N                   &      106626   &      106626   &       90650   &       90650   \\
r2                  &       0.255   &       0.255   &       0.262   &       0.262   \\
* p<0.05, ** p<0.01, *** p<0.001

. 
. * ------------------------------*
. * Duration regressions (Table 8)
. * ------------------------------*
. 
. /* ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ *\
>   Run programs here when final model specs are determined 
> \* ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ */ 
. 
. 
. * ------------------------------*
. * Appendix reg table: (Table A11)
. * ------------------------------*
. ppm_regs, ppm(g_ppm) estimator(logit) margins quietly
Dependent variable: g_ppm

                    &       reg1a   &       reg1b   &       reg1c   &       reg1d   \\
                    &        b/se   &        b/se   &        b/se   &        b/se   \\
Trial start year    &      0.0029***&      0.0029***&      0.0045***&      0.0045***\\
                    &    (0.0002)   &    (0.0002)   &    (0.0003)   &    (0.0003)   \\
Phase 2 Clinical (includes Phase 2/Phase 3 trials)&      0.0119***&      0.0114** &      0.0144***&      0.0138***\\
                    &    (0.0033)   &    (0.0036)   &    (0.0032)   &    (0.0036)   \\
Phase 3 Clinical    &      0.0175*  &      0.0165*  &      0.0194** &      0.0184*  \\
                    &    (0.0068)   &    (0.0074)   &    (0.0069)   &    (0.0075)   \\
Trial site in US=1  &      0.0057   &      0.0056***&      0.0063   &      0.0062***\\
                    &    (0.0054)   &    (0.0016)   &    (0.0064)   &    (0.0018)   \\
Drug indication for neoplasm=1&      0.1207***&      0.1206***&      0.1294***&      0.1293***\\
                    &    (0.0036)   &    (0.0031)   &    (0.0039)   &    (0.0034)   \\
NIH funding         &     -0.0061***&     -0.0042***&     -0.0079***&     -0.0056***\\
                    &    (0.0015)   &    (0.0006)   &    (0.0016)   &    (0.0008)   \\
Biomarker type: genomic=1&      0.2053***&      0.2058***&      0.2035***&      0.2040***\\
                    &    (0.0067)   &    (0.0062)   &    (0.0076)   &    (0.0069)   \\
N                   &      106626   &      106626   &       90650   &       90650   \\
r2                  &               &               &               &               \\
* p<0.05, ** p<0.01, *** p<0.001

. ppm_regs, ppm(r_ppm) estimator(logit) margins quietly
Dependent variable: r_ppm

                    &       reg1a   &       reg1b   &       reg1c   &       reg1d   \\
                    &        b/se   &        b/se   &        b/se   &        b/se   \\
Trial start year    &      0.0025***&      0.0025***&      0.0038***&      0.0038***\\
                    &    (0.0002)   &    (0.0002)   &    (0.0002)   &    (0.0002)   \\
Phase 2 Clinical (includes Phase 2/Phase 3 trials)&      0.0139***&      0.0137***&      0.0162***&      0.0158***\\
                    &    (0.0019)   &    (0.0022)   &    (0.0019)   &    (0.0022)   \\
Phase 3 Clinical    &      0.0235***&      0.0229***&      0.0254***&      0.0247***\\
                    &    (0.0036)   &    (0.0040)   &    (0.0038)   &    (0.0043)   \\
Trial site in US=1  &      0.0029   &      0.0028** &      0.0028   &      0.0027*  \\
                    &    (0.0033)   &    (0.0009)   &    (0.0039)   &    (0.0011)   \\
Drug indication for neoplasm=1&      0.1202***&      0.1201***&      0.1288***&      0.1288***\\
                    &    (0.0021)   &    (0.0017)   &    (0.0023)   &    (0.0019)   \\
NIH funding         &     -0.0060***&     -0.0049***&     -0.0067***&     -0.0054***\\
                    &    (0.0015)   &    (0.0007)   &    (0.0015)   &    (0.0007)   \\
Biomarker type: genomic=1&      0.1819***&      0.1822***&      0.1794***&      0.1797***\\
                    &    (0.0041)   &    (0.0037)   &    (0.0046)   &    (0.0041)   \\
N                   &      106626   &      106626   &       90650   &       90650   \\
r2                  &               &               &               &               \\
* p<0.05, ** p<0.01, *** p<0.001

. 
. 
. 
. log close
      name:  <unnamed>
       log:  /disk/homedirs/nber/bergerb/cortellis_projects/clinical_trials/reports/regression_output_08-28-17/regression_output_08-28-17.log
  log type:  text
 closed on:  29 Aug 2017, 10:19:40
------------------------------------------------------------------------------------------------------------------------------------------------------
