
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   14.2   Copyright 1985-2015 StataCorp LP
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

18-user 8-core Stata network perpetual license:
       Serial number:  501406201034
         Licensed to:  National Bureau of Economic Research
                       Cambridge, MA 02138

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.


running /disk/admin/Linux-local/stata14/sysprofile.do ...

. do 2_Add_Biomarker_Variable_P2_Data.do 

. /****************************************************************************
> *******
> File        : 2_Add_Biomarker_Variable_P2_Data.do
> Authors     : Alice Ndikumana
> Created     : 25 Jul 2016
> Modified    : 25 Jul 2016
> Description : Create list of unique biomarkers featured in P2 data
> *****************************************************************************
> ******/
. 
. do setup.do

. global raw = "../data/raw"

. global interim = "../data/interim"

. global processed = "../data/processed"

. 
end of do-file

. 
. use "$processed/clinical-trials.dta"

. 
. * Create a cross walk of "biomarkers" to Row ID to facilitate mapping identif
> iers back to Clinical trials
. * split multiple biomarkers listed into single observations and reshape to ge
> nerate a list of biomarkers in the dataset
. keep biomarker row_id

. split biomarker, p(";")
variables created as string: biomarker1biomarker11biomarker21biomarker31biomark
> er41                                                           biomarker51
biomarker2   biomarker12  biomarker22  biomarker32  biomarker42  biomarker52
biomarker3   biomarker13  biomarker23  biomarker33  biomarker43  biomarker53
biomarker4   biomarker14  biomarker24  biomarker34  biomarker44  biomarker54
biomarker5   biomarker15  biomarker25  biomarker35  biomarker45  biomarker55
biomarker6   biomarker16  biomarker26  biomarker36  biomarker46  biomarker56
biomarker7   biomarker17  biomarker27  biomarker37  biomarker47  biomarker57
biomarker8   biomarker18  biomarker28  biomarker38  biomarker48  biomarker58
biomarker9   biomarker19  biomarker29  biomarker39  biomarker49  biomarker59
biomarker10  biomarker20  biomarker30  biomarker40  biomarker50

. drop biomarker

. reshape long biomarker, i(row_id) j(counter)
(note: j = 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26
>  27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 5
> 2 53 54 55 56 57 58 59)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                    42591   -> 2.5e+06
Number of variables                  60   ->       3
j variable (59 values)                    ->   counter
xij variables:
  biomarker1 biomarker2 ... biomarker59   ->   biomarker
-----------------------------------------------------------------------------

. 
. * cleanse list of biomarkers and save crosswalk
. drop counter

. drop if biomarker==""
(2,451,831 observations deleted)

. replace biomarker=lower(biomarker)
(60,966 real changes made)

. replace biomarker = trim(biomarker)
(44,773 real changes made)

. duplicates drop

Duplicates in terms of all variables

(1 observation deleted)

. label var bio "Biomarkers"

. save "$interim/P2_Clinical_Trial_Biomarkers_RowID_Key.dta", replace
(note: file ../data/interim/P2_Clinical_Trial_Biomarkers_RowID_Key.dta not foun
> d)
file ../data/interim/P2_Clinical_Trial_Biomarkers_RowID_Key.dta saved

. 
. * Drop row_id and drop duplicates to get a unique list of biomarkers in the P
> 2 data set
. drop row_id

. duplicates drop

Duplicates in terms of all variables

(57,707 observations deleted)

. 
. * save list of unique biomarkers
. save "$interim/P2_Clinical_Trial_Biomarkers_All.dta", replace
(note: file ../data/interim/P2_Clinical_Trial_Biomarkers_All.dta not found)
file ../data/interim/P2_Clinical_Trial_Biomarkers_All.dta saved

. 
end of do-file
