
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   14.2   Copyright 1985-2015 StataCorp LP
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

18-user 8-core Stata network perpetual license:
       Serial number:  501406201034
         Licensed to:  National Bureau of Economic Research
                       Cambridge, MA 02138

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.


running /disk/admin/Linux-local/stata14/sysprofile.do ...

. do 2_Map_Condition_to_ICD9Code_P2_Data.do 

. /****************************************************************************
> *******
> File        : 2_Map_Condition_to_ICD9Code_P2_Data.do
> Authors     : Alice Ndikumana
> Created     : 1 Jul 2016
> Modified    : 15 Aug 2016
> Description : Maps cortellis conditions in P2 Cortellis Clinical Trials data 
> to
> ICD-9 codes
> *****************************************************************************
> ******/
. 
. do setup.do

. global raw = "../data/raw"

. global interim = "../data/interim"

. global processed = "../data/processed"

. 
end of do-file

. 
. * First, create a crosswalk between Cortellis indications and ICD-9 codes, us
> ing files from Josh Krieger
. 
. * import the indication key, which pairs Cortellis drug indications with an I
> D
. import delimited "$raw/CortellisDrugsIndicationsKey.txt", delimiter("|") varn
> ames(1)
(2 vars, 1,941 obs)

. save "$interim/temp.dta", replace
(note: file ../data/interim/temp.dta not found)
file ../data/interim/temp.dta saved

. 
. * The Cortellis Indications ICD9 Crosswalk matches the indication IDs to ICD9
>  codes
. * merge the indication key with the crosswalk to match drug indications to IC
> D-9 codes
. clear

. import delimited "$raw/CortellisIndicationsICD9Crosswalk_ProfessionallyCoded_
> Nov2014 (1).txt", delimiter("|") varnames(1)
(2 vars, 1,940 obs)

. merge 1:1 indicationsid using "$interim/temp.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                             1
        from master                         0  (_merge==1)
        from using                          1  (_merge==2)

    matched                             1,940  (_merge==3)
    -----------------------------------------

. !rm "$interim/temp.dta"

rm: remove regular file `../data/interim/temp.dta'? 
. label var icd9 "ICD-9"

. * drop uneeded variables
. drop _merge indicationsid

. 
. * make all indications lowercase & rename variable as 'condition' to facilita
> te mapping to Cortellis conditions
. replace ind = lower(ind)
(1,941 real changes made)

. rename ind condition

. label var condition "Condition"

. 
. * save the crosswalk from Cortellis drug indications to ICD-9 codes
. save "$interim/Cortellis_Drug_Indication_ICD9_Crosswalk.dta", replace
(note: file ../data/interim/Cortellis_Drug_Indication_ICD9_Crosswalk.dta not fo
> und)
file ../data/interim/Cortellis_Drug_Indication_ICD9_Crosswalk.dta saved

. clear

. 
. *Next, create a list of unique conditions listed in the phase 2 Cortellis Cli
> nical trials data
. 
. use "$processed/clinical-trials.dta"

. 
. * keep only condition variable and observation ID (row_id)
. keep condition cortellis_clinical_trial_id

. 
. * split multiple conditions listed per observation and reshape to generate a 
> list of conditions in the dataset
. split condition, p(";")
variables created as string: condition1condition12condition23condition34conditi
> on45                                                           condition56
condition2   condition13  condition24  condition35  condition46  condition57
condition3   condition14  condition25  condition36  condition47  condition58
condition4   condition15  condition26  condition37  condition48  condition59
condition5   condition16  condition27  condition38  condition49  condition60
condition6   condition17  condition28  condition39  condition50  condition61
condition7   condition18  condition29  condition40  condition51  condition62
condition8   condition19  condition30  condition41  condition52  condition63
condition9   condition20  condition31  condition42  condition53
condition10  condition21  condition32  condition43  condition54
condition11  condition22  condition33  condition44  condition55

. drop condition

. reshape long condition, i(cortellis) j(counter)
(note: j = 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26
>  27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 5
> 2 53 54 55 56 57 58 59 60 61 62 63)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                    42591   -> 2.7e+06
Number of variables                  64   ->       3
j variable (63 values)                    ->   counter
xij variables:
  condition1 condition2 ... condition63   ->   condition
-----------------------------------------------------------------------------

. 
. * save a cross walk of Cortellis Conditions to Row ID to facilitate mapping c
> onditions back to Clinical trials
. drop counter

. drop if condition==""
(2,631,001 observations deleted)

. replace condition=lower(condition)
(52,232 real changes made)

. replace condition = trim(condition)
(10,293 real changes made)

. label var condition "Condition"

. save "$interim/P2_Clinical_Trials_Conditions_TrialID_key.dta", replace
(note: file ../data/interim/P2_Clinical_Trials_Conditions_TrialID_key.dta not f
> ound)
file ../data/interim/P2_Clinical_Trials_Conditions_TrialID_key.dta saved

. 
. * keep list of only unique P2 Cortellis Clinical Trials to attempt matching w
> ith the ICD9 crosswalk
. drop cortellis

. duplicates drop

Duplicates in terms of all variables

(50,355 observations deleted)

. 
. * map P2 Cortellis conditions to ICD-9 codes using the crosswalk, drop all un
> matched indications
. merge 1:1 condition using "$interim/Cortellis_Drug_Indication_ICD9_Crosswalk.
> dta"
(note: variable condition was str49, now str50 to accommodate using data's
       values)

    Result                           # of obs.
    -----------------------------------------
    not matched                           730
        from master                       333  (_merge==1)
        from using                        397  (_merge==2)

    matched                             1,544  (_merge==3)
    -----------------------------------------

. * drop the Drug Indications that do not match P2 Cortellis Clinical Trial con
> ditions
. drop if _merge==2
(397 observations deleted)

. 
. * create new variables that clarify if Cortellis Clinical Trials was mapped t
> o an ICD9 code
. gen match_to_ICD9_crosswalk=""
(1,877 missing values generated)

. label var match "Match to ICD9 Crosswalk?"

. replace match="condition mapped to ICD9 code" if _m==3
variable match_to_ICD9_crosswalk was str1 now str29
(1,544 real changes made)

. replace match="condition not matched to ICD9 code" if _m==1
variable match_to_ICD9_crosswalk was str29 now str34
(333 real changes made)

. drop _m

. 
. * save and export to excel to review remaining unmatched conditions
. save "$interim/P2_Cortellis_Conditions_Partial_ICD9_Match_15Aug.dta", replace
(note: file ../data/interim/P2_Cortellis_Conditions_Partial_ICD9_Match_15Aug.dt
> a not found)
file ../data/interim/P2_Cortellis_Conditions_Partial_ICD9_Match_15Aug.dta saved

. 
end of do-file
